{"data":{"allMarkdownRemark":{"totalCount":5,"edges":[{"node":{"fields":{"slug":"/blog/upgrade-guide-gatsby-v-2"},"excerpt":"Die Beta zu Gatsby v2 ist da! Im  offiziellen Blogpost  kannst du die Änderungen im Detail nachlesen — kurz zusammengefasst gibt es folgendes dazu zu sagen: Das Konzept der Layouts wurde entfernt, dafür gibt es nun die  StaticQuery . Die Dependencies wurden auf den aktuellen Stand gebracht (sprich…","timeToRead":6,"frontmatter":{"title":"Upgrade-Guide: Gatsby v2","tags":["Gatsby","GRB-Reihe"],"date":"17. Juni 2018","category":"Coding"}}},{"node":{"fields":{"slug":"/blog/kategorien-tags-zu-gatsby-hinzufugen"},"excerpt":"Um auch langfristig den Überblick über alle Blogposts zu behalten, werden diese gerne in Kategorien eingeordnet und mit Stichwörtern (Tags) verschlagwortet. Genau das will ich in diesem Tutorial erklären: Die Einträge um Kategorien erweitern, diese Informationen im Beitrag anzeigen und…","timeToRead":6,"frontmatter":{"title":"Kategorien & Tags zu Gatsby hinzufügen","tags":["Gatsby","GRB-Reihe"],"date":"28. März 2018","category":"Tutorial"}}},{"node":{"fields":{"slug":"/blog/styled-components-in-gatsby-nutzen"},"excerpt":"Nach dem  ersten  und  zweiten  Teil meiner Gatsby-Reihe soll es nun um  styled-components  gehen. Die CSS-in-JS Library erfreut sich großer Beliebtheit unter React Entwicklern und ist momentan auch mein Favorit. Aber wieso eine CSS-in-JS Library nutzen und im speziellen styled-components? CSS-in-JS…","timeToRead":6,"frontmatter":{"title":"styled-components in Gatsby nutzen","tags":["Gatsby","styled-components","React","GRB-Reihe"],"date":"13. März 2018","category":"Tutorial"}}},{"node":{"fields":{"slug":"/blog/react-code-styling-mit-es-lint-und-prettier"},"excerpt":"Nachdem wir im  ersten Teil  unseren Gatsby Blog erstellt und veröffentlicht haben, wird es in den folgenden Teilen darum gehen diesen mit Funktionen stetig zu erweitern. Im Laufe der Tutorials wirst du einiges an React Code schreiben müssen - und dabei schleichen sich immer wieder gerne…","timeToRead":6,"frontmatter":{"title":"React Code Styling mit ESLint und Prettier","tags":["Gatsby","React","ESLint","Prettier","GRB-Reihe"],"date":"01. März 2018","category":"Tutorial"}}},{"node":{"fields":{"slug":"/blog/ultra-schnellen-blog-mit-react-und-gatsby-erstellen"},"excerpt":"Gatsby ist ein blitzschneller  Static Site Generator  basierend auf  React . Wer keine Lust auf ein großes CMS wie Wordpress hat, aber dennoch gerne etwas mehr als reine HTML-Seiten bearbeiten will, wird  Gatsby  sicherlich lieben (natürlich muss man auch React mögen). Gatsby erfüllt alle Ansprüche…","timeToRead":17,"frontmatter":{"title":"Ultra-schnellen Blog mit React und Gatsby erstellen","tags":["Gatsby","Blog","React","GRB-Reihe"],"date":"04. Februar 2018","category":"Tutorial"}}}]}},"pageContext":{"tag":"GRB-Reihe"}}